app/controllers/songs_controller.rb

  def index
    if params[:artist_id]
      @songs = Artist.find(params[:artist_id]).songs
    else
      @songs = Song.all
---
SELECT "artists".* FROM "artists"